Unable to make the necessary Workset ([Name]) editable in the Linked File in order to change the Shared Coordinates.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId UnableToMakeSourceWorksetEditable { get; }
  Visual Basic
Public Shared ReadOnly Property UnableToMakeSourceWorksetEditable As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ UnableToMakeSourceWorksetEditable {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace